{
    "projects": [
        {
            "id": "1",
            "name": "StudyMate",
            "thumbnail": "study-mate.png",
            "shortDescription": "StudyMate is a platform that helps students find compatible study partners based on subject, experience level, and preferred study mode (Online, In-Person, Hybrid).",
            "techStack": [
                "React",
                "Tailwind CSS",
                "daisyUI",
                "Swiper",
                "Axios",
                "React Hot Toast",
                "Express",
                "MongoDB"
            ],
            "liveLink": "https://study-mate-swart.vercel.app/",
            "githubClient": "https://github.com/sami157/a10-client",
            "details": {
                "description": "A student collaboration platform that connects learners with compatible study partners based on subject, experience level, and study mode preferences, featuring a smart discovery system and request management.",
                "challenges": [
                    "Managing partner request state across multiple components",
                    "Implementing real-time search and filtering without performance lag",
                    "Synchronizing theme toggle across all components and persistent storage",
                    "Handling concurrent partner requests and preventing duplicates",
                    "Ensuring data consistency between frontend and MongoDB backend"
                ],
                "futurePlans": [
                    "Add real-time chat functionality between matched study partners",
                    "Implement study session scheduling with calendar integration",
                    "Create a rating and review system for completed study partnerships",
                    "Add email notifications for new partner requests and acceptances",
                    "Build recommendation algorithm based on past successful matches",
                    "Integrate video call functionality for online study sessions",
                    "Add study group creation for multiple partners studying together"
                ]
            }
        },
        {
            "id": "2",
            "name": "ContestHub",
            "thumbnail": "contest-hub.png",
            "shortDescription": "A full-stack creative contest management platform with role-based access and Stripe payments.",
            "techStack": [
                "React",
                "Node.js",
                "Express.js",
                "MongoDB",
                "Tailwind CSS",
                "Stripe",
                "JWT"
            ],
            "liveLink": "https://a11-contesthub.web.app/",
            "githubClient": "https://github.com/sami157/assignment-11-contesthub-client",
            "details": {
                "description": "A production-ready contest management platform enabling users to explore, register, and participate in creative contests through secure payments. Features role-based dashboards for admins, contest creators, and participants with JWT authentication and Stripe integration.",
                "challenges": [
                    "Implementing secure role-based authorization across frontend and backend",
                    "Managing complex payment flow with Stripe and ensuring transaction verification",
                    "Synchronizing contest approval workflow between creators and admins",
                    "Handling state management for multi-role dashboards efficiently",
                    "Ensuring payment validation before confirming contest participation"
                ],
                "futurePlans": [
                    "Add real-time notifications for contest updates and winner announcements",
                    "Implement leaderboard and ranking system for top participants",
                    "Create social sharing features for contests and achievements",
                    "Add multi-currency support for international users",
                    "Integrate analytics dashboard for contest creators to track performance",
                    "Build commenting and feedback system for contests",
                    "Add automated email reminders for contest deadlines",
                    "Implement portfolio showcase for winners to display their work"
                ]
            }
        },
        {
            "id": "3",
            "name": "Hero Apps",
            "thumbnail": "hero-apps.png",
            "shortDescription": "Website to showcase a selection of apps",
            "techStack": [
                "React",
                "Tailwind CSS",
                "daisyUI"
            ],
            "liveLink": "https://hero-apps-flax.vercel.app/",
            "githubClient": "https://github.com/sami157/assignment-8-hero-apps",
            "details": {
                "description": "Users can view apps with trending ones shown separately. Search functionality is available and users can see details with detailed analysis of ratings.",
                "challenges": [
                    "Maintaining real-time trending data accuracy",
                    "Scaling app performance with growing app catalog",
                    "Optimizing search with typos and vague queries",
                    "Managing load times for analytics-heavy pages"
                ],
                "futurePlans": [
                    "Add personalized app recommendations based on user preferences and history",
                    "Implement user reviews and comments for community engagement",
                    "Create comparison tools to view multiple apps side-by-side",
                    "Add filtering options by category, price range, and ratings",
                    "Integrate with app stores for direct installation or purchase links",
                    "Build a watchlist feature so users can track apps they're interested in",
                    "Add price tracking and alerts for paid apps going on sale",
                    "Implement advanced analytics like rating trends over time and version comparisons"
                ]
            }
        }
    ]
}